/* No comment provided by engineer. */
"iTunes Podcast Directory" = "iTunes Podcast Directory";

/* No comment provided by engineer. */
"Podcasts" = "Podcasts";

/* No comment provided by engineer. */
"Update the iTunes Podcast Directory with new entries from the Podcast Library (you must have already declared your Podcast Library feeds in the iTunes Store)" = "Update the iTunes Podcast Directory with new entries from the Podcast Library (you must have already declared your Podcast Library feeds in the iTunes Store)";

